{
    "legal_docs": {
        "terms_content": "Este es el contenido de tus términos y condiciones. Puedes reemplazarlo con tu texto real.",
        "cookies_content": "Este es el contenido de tu política de cookies. Puedes reemplazarlo con tu texto real.",
        "privacy_title": "Política de Privacidad de ProjectNocturne",
        "privacy_last_updated": "Última Actualización y Entrada en Vigor:",
        "privacy_intro_title": "1. Introducción y Filosofía de Privacidad",
        "privacy_intro_p1": "Le extendemos la más cordial bienvenida a ProjectNocturne (en adelante, \"la Plataforma\" o \"el Servicio\"). Nuestra principal vocación es ofrecer un ecosistema de herramientas digitales de alta productividad, diseñadas para ser potentes, intuitivas y profundamente personalizables. Entendemos que la relación con nuestros usuarios se cimienta sobre la base de la confianza, y por ello, nuestro compromiso con la protección, la seguridad y la transparencia en el tratamiento de los datos es un pilar fundamental e irrenunciable de nuestra operación.",
        "privacy_intro_p2": "<strong>Aceptación de la Política:</strong> Al utilizar este sitio web, usted declara que ha leído, comprendido y aceptado los términos y condiciones establecidos en esta Política de Privacidad. Si no está de acuerdo con alguno de los puntos aquí expuestos, le solicitamos que se abstenga de utilizar nuestros servicios.",
        "privacy_intro_p3": "La presente Política de Privacidad ha sido concebida para ser un documento exhaustivo y accesible. Su objetivo es proporcionar una visión clara y sin ambigüedades sobre cada categoría de datos que recopilamos, los fines específicos y legítimos para los cuales estos son procesados, las tecnologías subyacentes que facilitan la prestación de nuestros servicios y, de manera crucial, los derechos inalienables que usted, como titular de sus datos, posee y puede ejercer. El uso y la interacción continuada con la Plataforma suponen la lectura, comprensión y aceptación de las prácticas operativas aquí descritas.",
        "privacy_definitions_title": "2. Definiciones Clave",
        "privacy_definitions_intro": "Para garantizar una comprensión unívoca y precisa de este documento, es fundamental establecer las siguientes definiciones que serán utilizadas a lo largo de esta política:",
        "privacy_def_personal_data": "<strong>Datos Personales:</strong> Se refiere a cualquier pieza de información que, ya sea por sí sola o en combinación con otros datos disponibles, permita identificar de manera directa o indirecta a una persona física. En el contexto específico de ProjectNocturne, y en estricta aplicación del principio de minimización, el único dato personal que podríamos llegar a tratar es su <strong>dirección de correo electrónico</strong>, y esto ocurre únicamente cuando usted decide proporcionárnosla de forma voluntaria a través de nuestros formularios de contacto o sugerencias.",
        "privacy_def_usage_telemetry": "<strong>Datos de Uso y Telemetría:</strong> Corresponde a toda la información que se genera y recopila de forma automática durante su interacción con la Plataforma. Es importante destacar que estos datos son de naturaleza anónima y no están vinculados a su identidad personal. Incluyen, entre otros, el <strong>identificador de sesión anónimo (UUID)</strong> para distinguir sesiones de uso sin identificar al usuario, <strong>eventos de interacción</strong> (como clics en funciones específicas) para análisis de usabilidad, y <strong>metadatos técnicos</strong> como el tipo de navegador, sistema operativo y país de origen, con el fin de optimizar la compatibilidad y el rendimiento.",
        "privacy_def_user": "<strong>Usuario:</strong> Es toda persona física que, de manera libre y voluntaria, accede, navega o utiliza cualquiera de las herramientas y funcionalidades ofrecidas por la Plataforma ProjectNocturne a través de su dominio web.",
        "privacy_def_controller": "<strong>Responsable del Tratamiento:</strong> Es la entidad que, sola o en conjunto con otras, toma las decisiones fundamentales sobre el tratamiento de los datos personales, incluyendo la determinación de los fines (el \"para qué\") y los medios (el \"cómo\"). Para todos los efectos legales y prácticos, <strong>ProjectNocturne</strong> es el único y final Responsable del Tratamiento de los datos cubiertos por esta política.",
        "privacy_controller_role_title": "3. Identificación y Rol del Responsable del Tratamiento de Datos",
        "privacy_controller_role_p1": "En el marco de la legislación aplicable en materia de protección de datos, tanto a nivel nacional como internacional, se define al \"Responsable del Tratamiento\" como la persona física o jurídica que, sola o junto con otras, determina los fines y medios del tratamiento de los datos personales.",
        "privacy_controller_role_p2": "Para todos los efectos legales y de transparencia, se establece que <strong>ProjectNocturne</strong>, como entidad digital accesible a través de su dominio web oficial, actúa como el único y final Responsable del Tratamiento de todos los datos personales y datos de uso que son recopilados y procesados a través de las interacciones de los usuarios con la Plataforma.",
        "privacy_controller_role_p3": "Esta responsabilidad implica un deber de diligencia activa que abarca desde la definición de las políticas de privacidad y la implementación de medidas de seguridad, hasta la garantía del ejercicio efectivo de los derechos de los usuarios. Como Responsable del Tratamiento, ProjectNocturne asume el compromiso de asegurar que todo el ciclo de vida de los datos —desde su recolección hasta su eventual eliminación— se gestione de conformidad con los principios de licitud, lealtad, transparencia, minimización y confidencialidad aquí establecidos. Cualquier consulta sobre el tratamiento de sus datos debe dirigirse a los canales de contacto especificados en este documento.",
        "privacy_principles_title": "4. Principios Rectores del Tratamiento de Datos",
        "privacy_principles_intro": "Nuestro compromiso con su privacidad es absoluto. Por ello, todas nuestras actividades de tratamiento de datos se rigen por los siguientes principios fundamentales, los cuales constituyen el pilar de nuestro marco ético y operativo, asegurando un manejo de la información justo, transparente y alineado con las mejores prácticas internacionales:",
        "privacy_principles_lft": "<strong>Licitud, Lealtad y Transparencia:</strong> Todo tratamiento de datos que realizamos se fundamenta en una base legal sólida y claramente definida en esta política. Actuamos con la máxima lealtad hacia nuestros usuarios, lo que significa que nunca trataremos sus datos de formas que no esperaría razonablemente. La transparencia es clave: le informamos de manera clara y accesible sobre qué datos recopilamos y para qué los utilizamos.",
        "privacy_principles_purpose": "<strong>Limitación de la Finalidad:</strong> Los datos que recopilamos son utilizados única y exclusivamente para los fines explícitos y legítimos que se detallan en el apartado 6 de esta política. Nos comprometemos a no tratar sus datos para propósitos ulteriores que sean incompatibles con aquellos para los que fueron inicialmente recogidos, garantizando así que la información se utiliza de manera predecible y respetuosa.",
        "privacy_principles_minimization": "<strong>Minimización de Datos:</strong> Adoptamos un enfoque de \"privacidad por diseño y por defecto\". Esto significa que solo recopilamos la cantidad mínima de información estrictamente necesaria, adecuada y pertinente para cumplir con cada finalidad específica. No solicitamos ni recopilamos datos que no sean indispensables para el funcionamiento y la mejora de la Plataforma.",
        "privacy_principles_security": "<strong>Integridad y Confidencialidad:</strong> La seguridad de sus datos es una prioridad crítica. Implementamos y mantenemos un conjunto robusto de medidas de seguridad técnicas y organizativas, como el cifrado de comunicaciones y controles de acceso estrictos, para proteger toda la información contra el tratamiento no autorizado o ilícito, así como contra su pérdida, destrucción o daño accidental.",
        "privacy_data_types_title": "5. Tipos de Datos Recopilados y Canales de Obtención",
        "privacy_data_types_intro": "La funcionalidad de la Plataforma requiere la recopilación de distintas categorías de datos, las cuales se desglosan a continuación para su total conocimiento:",
        "privacy_data_types_local_title": "<strong>5.1. Datos de Funcionalidad Esencial (Almacenamiento Local del Navegador):</strong>",
        "privacy_data_types_local_p1": "Para que ProjectNocturne sea una herramienta verdaderamente útil y personalizada, dependemos de las tecnologías de almacenamiento local de su navegador (`localStorage` e `IndexedDB`). Este enfoque descentralizado le otorga a usted, el usuario, un control directo y soberano sobre sus datos de configuración. La información almacenada localmente incluye:",
        "privacy_data_types_local_li1": "<strong>Configuración de Herramientas (localStorage):</strong> Almacenamos de forma persistente la configuración de cada alarma, temporizador y reloj mundial que usted crea. Esto abarca títulos, horas, sonidos seleccionados, y estados operativos.",
        "privacy_data_types_local_li2": "<strong>Preferencias de Interfaz (localStorage):</strong> Guardamos sus elecciones de personalización, como el tema visual (claro/oscuro), el color del texto y la escala de la fuente, para que la interfaz se adapte a su gusto en cada visita.",
        "privacy_data_types_local_li3": "<strong>Archivos de Audio Personalizados (IndexedDB):</strong> Si usted utiliza la función de subir sus propios sonidos para las alertas, estos archivos se guardan en la base de datos `IndexedDB` de su navegador. Este es un almacenamiento local y privado en su máquina; estos archivos nunca son transferidos a nuestros servidores.",
        "privacy_data_types_user_title": "<strong>5.2. Datos Proporcionados Directamente por el Usuario:</strong>",
        "privacy_data_types_user_li1": "<strong>Formulario de Sugerencias y Mejoras:</strong> Cuando nos contacta a través del formulario de sugerencias, recopilamos los datos que nos proporciona voluntariamente: su <strong>dirección de correo electrónico</strong>, la <strong>categoría de su feedback</strong> y el <strong>contenido de su mensaje</strong>.",
        "privacy_data_types_telemetry_title": "<strong>5.3. Datos de Uso y Telemetría Anónima:</strong>",
        "privacy_data_types_telemetry_p1": "Para mejorar la Plataforma, recopilamos datos de uso de forma anónima, los cuales no permiten su identificación personal:",
        "privacy_data_types_telemetry_li1": "<strong>Identificador Único de Sesión (UUID):</strong> Asignamos un identificador anónimo a su navegador (`user-unique-id`) para agrupar métricas de uso sin recopilar información personal.",
        "privacy_data_types_telemetry_li2": "<strong>Telemetría de Eventos:</strong> Registramos interacciones anónimas clave con las funcionalidades de la plataforma. Estos datos son cruciales para nuestro análisis de usabilidad y para entender qué herramientas son más valoradas por nuestros usuarios.",
        "privacy_data_types_telemetry_li3": "<strong>Datos Técnicos y Geográficos:</strong> Detectamos su <strong>país</strong> de origen (sin almacenar su IP), <strong>sistema operativo</strong>, y <strong>navegador web</strong> para optimizar la compatibilidad y la experiencia.",
        "privacy_purposes_title": "6. Finalidades Detalladas del Tratamiento de Datos",
        "privacy_purposes_intro": "El tratamiento de cada categoría de datos persigue objetivos claros, definidos y legítimos, orientados exclusivamente a la prestación y mejora continua de nuestros servicios. A continuación, se detallan estas finalidades:",
        "privacy_purposes_op": "<strong>Para la Operación y Mantenimiento del Servicio:</strong> El almacenamiento local de sus configuraciones y preferencias es fundamental para la funcionalidad principal de la Plataforma. Sin esta capacidad, sus alarmas personalizadas, temporizadores, relojes mundiales y preferencias de diseño (tema, color, fuente) se perderían cada vez que cierre o actualice la página. Esta finalidad es, por tanto, esencial para ofrecerle una experiencia de usuario coherente, persistente y verdaderamente personalizada, que es el núcleo de nuestra propuesta de valor.",
        "privacy_purposes_imp": "<strong>Para la Mejora Continua y el Análisis Estratégico:</strong> La recopilación de telemetría y datos de uso anónimos es una herramienta vital para la evolución de ProjectNocturne. Estos datos agregados nos permiten entender cómo interactúan los usuarios con las diferentes herramientas, cuáles son las funciones más utilizadas y dónde pueden existir puntos de fricción o dificultad. Este análisis cuantitativo guía nuestras decisiones de desarrollo, nos ayuda a priorizar nuevas funcionalidades, a optimizar los flujos de trabajo existentes y a garantizar que nuestros recursos se inviertan en las áreas que aportan mayor valor a nuestra comunidad de usuarios.",
        "privacy_purposes_comms": "<strong>Para la Gestión de Comunicaciones y Soporte al Usuario:</strong> Cuando usted nos envía sus comentarios, sugerencias o informes de errores a través del formulario de contacto, utilizamos la información proporcionada (su correo electrónico y el contenido de su mensaje) con el único propósito de gestionar esa comunicación. Esto incluye procesar su solicitud, investigar el problema reportado, responder a sus preguntas y, en general, proporcionarle el soporte que necesita. No utilizaremos su correo electrónico para fines de marketing no solicitados.",
        "privacy_purposes_ux": "<strong>Para la Personalización de la Experiencia de Usuario:</strong> Más allá de las configuraciones que usted guarda activamente, la Plataforma realiza una detección inicial de factores como el idioma de su navegador y las preferencias de tema de su sistema operativo. Esta información se utiliza para configurar automáticamente la interfaz a un estado inicial que le resulte familiar y cómodo desde el primer momento, reduciendo la necesidad de ajustes manuares y haciendo que la Plataforma se sienta más intuitiva y adaptada a su entorno digital.",
        "privacy_legal_basis_title": "7. Base Jurídica para el Tratamiento",
        "privacy_legal_basis_intro": "Todo tratamiento de datos que realizamos en ProjectNocturne se apoya en una base jurídica sólida y transparente, de conformidad con las principales normativas de protección de datos, como el Reglamento General de Protección de Datos (RGPD) de la Unión Europea. Las bases legales que legitiman nuestras actividades de tratamiento son las siguientes:",
        "privacy_legal_basis_consent": "<strong>Su Consentimiento Explícito:</strong> Para ciertas actividades de tratamiento, nuestra legitimidad se basa en el consentimiento que usted nos otorga de manera libre, específica, informada e inequívoca. Este es el caso cuando usted decide voluntariamente utilizar nuestro formulario de sugerencias y nos proporciona su dirección de correo electrónico para que podamos responderle. Asimismo, al aceptar nuestra política de cookies y privacidad al utilizar el servicio, está consintiendo las prácticas aquí descritas. Usted tiene el derecho de retirar su consentimiento en cualquier momento, sin que ello afecte a la licitud del tratamiento basado en el consentimiento previo a su retirada.",
        "privacy_legal_basis_interest": "<strong>Nuestro Interés Legítimo:</strong> Para otras actividades, la base jurídica es nuestro interés legítimo como empresa para operar y mejorar nuestro servicio. Esto se aplica específicamente a la recopilación de datos de uso y telemetría anónimos. Nuestro interés legítimo consiste en comprender cómo se utiliza nuestra Plataforma para poder mejorarla, solucionar errores y tomar decisiones estratégicas sobre su desarrollo futuro. Hemos realizado una ponderación para asegurar que este interés no prevalezca sobre sus derechos y libertades fundamentales, especialmente porque los datos se procesan de forma anónima y no permiten su identificación personal.",
        "privacy_retention_title": "8. Política de Retención y Eliminación de Datos",
        "privacy_retention_intro": "En ProjectNocturne, aplicamos una política de retención de datos diferenciada y transparente, diseñada para darle el máximo control sobre su información y para asegurar que no almacenamos datos más allá de lo estrictamente necesario.",
        "privacy_retention_local": "<strong>Datos Locales (`localStorage` e `IndexedDB`):</strong> Esta categoría de datos, que incluye todas sus configuraciones de herramientas y preferencias de interfaz, reside exclusivamente en su dispositivo, dentro del almacenamiento seguro de su navegador web. <strong>Usted tiene el control total y absoluto sobre estos datos.</strong> Permanecen en su dispositivo de forma indefinida para garantizar la persistencia de su experiencia personalizada cada vez que visita la Plataforma. La eliminación de estos datos está completamente en sus manos y puede realizarse en cualquier momento a través de las herramientas de limpieza de datos de navegación que ofrece su navegador (como \"Borrar datos de navegación\", \"Limpiar historial\" o similar).",
        "privacy_retention_server": "<strong>Datos del Servidor (Sugerencias y Telemetría):</strong> La información que se transmite a nuestros servidores, como los datos de su formulario de sugerencias (incluido su correo electrónico) y la telemetría de uso anónima, sigue un ciclo de vida definido. Estos datos se conservan únicamente durante el período de tiempo indispensable para cumplir con la finalidad para la que fueron recopilados. Por ejemplo, conservaremos los detalles de una sugerencia hasta que haya sido procesada y respondida. Una vez que la finalidad se ha cumplido, o si expira cualquier plazo legal aplicable, los datos son eliminados de forma segura y permanente de nuestros sistemas.",
        "privacy_rights_title": "9. Derechos del Usuario (ARCO) y Mecanismos de Ejercicio",
        "privacy_rights_intro": "En ProjectNocturne, no solo reconocemos, sino que garantizamos plenamente sus derechos sobre sus datos personales, en línea con los más altos estándares de protección de datos. Usted tiene el control y puede ejercer los siguientes derechos en cualquier momento:",
        "privacy_rights_access": "<strong>Derecho de Acceso:</strong> Usted tiene derecho a obtener confirmación de si en ProjectNocturne estamos tratando datos personales que le conciernen y, en tal caso, a acceder a dichos datos. Esto incluye el derecho a conocer los fines del tratamiento, las categorías de datos tratados y los destinatarios de los mismos. Dado que el único dato personal que almacenamos en el servidor es su correo electrónico (si nos contacta), puede solicitar la confirmación de su existencia y una copia del mismo.",
        "privacy_rights_rectification": "<strong>Derecho de Rectificación:</strong> Si considera que los datos personales que podamos tener sobre usted (como su dirección de correo electrónico en el contexto de una comunicación) son inexactos o incompletos, tiene derecho a solicitar su corrección sin dilación indebida.",
        "privacy_rights_erasure": "<strong>Derecho de Supresión (\"Derecho al Olvido\"):</strong> Usted tiene derecho a solicitar la eliminación de sus datos personales. Esto aplica tanto a los datos almacenados localmente en su navegador (que puede eliminar directamente a través de las opciones de limpieza de su navegador) como a los datos que podamos tener en nuestros servidores (como su correo electrónico tras una consulta). Una vez recibida su solicitud, procederemos a la eliminación segura de su información, siempre y cuando no exista una obligación legal que nos impida hacerlo.",
        "privacy_rights_objection": "<strong>Derecho a la Limitación y Oposición del Tratamiento:</strong> En determinadas circunstancias, usted tiene derecho a solicitar la limitación del tratamiento de sus datos o a oponerse a dicho tratamiento. Por ejemplo, puede oponerse a que sus datos (correo electrónico) sigan siendo tratados tras haber resuelto una consulta. Respetaremos su solicitud y cesaremos el tratamiento, salvo por motivos legítimos imperiosos o para la formulación, el ejercicio o la defensa de reclamaciones.",
        "privacy_security_title": "10. Medidas de Seguridad Implementadas",
        "privacy_security_intro": "La protección y la integridad de la información que usted nos confía, así como de los datos de uso que procesamos, constituyen una prioridad de máxima importancia para ProjectNocturne. Comprendemos la responsabilidad que esto conlleva y, en consecuencia, hemos implementado un marco de seguridad multicapa, adoptando medidas técnicas y organizativas robustas, diseñadas para mitigar los riesgos de acceso no autorizado, alteración, divulgación o destrucción accidental o ilícita de los datos.",
        "privacy_security_p1": "Nuestra estrategia de seguridad abarca las siguientes áreas clave:",
        "privacy_security_li1": "<strong>Seguridad en la Transmisión de Datos:</strong> Toda comunicación entre su navegador y nuestros servidores, especialmente aquella que involucra la transmisión de datos sensibles como los del formulario de sugerencias, se realiza a través de canales seguros utilizando protocolos de cifrado estándar de la industria (como TLS/SSL). Esto garantiza que la información viaje por la red de forma confidencial e íntegra.",
        "privacy_security_li2": "<strong>Seguridad en el Almacenamiento:</strong> Los datos que se alojan en nuestra infraestructura de servidor, como la telemetría anónima y las sugerencias, se almacenan en bases de datos con controles de acceso estrictos. El acceso a estas bases de datos está limitado exclusivamente al personal autorizado que necesita conocer la información para el desempeño de sus funciones, siguiendo el principio de mínimo privilegio.",
        "privacy_security_li3": "<strong>Seguridad a Nivel de Aplicación:</strong> Nuestra plataforma está desarrollada siguiendo las mejores prácticas de codificación segura para prevenir vulnerabilidades comunes. Realizamos revisiones periódicas de nuestro código y dependencias para identificar y mitigar posibles brechas de seguridad.",
        "privacy_security_li4": "<strong>Seguridad Operacional:</strong> Contamos con políticas internas de gestión de la seguridad de la información que rigen el acceso, el manejo y la protección de los datos. El personal con acceso a los sistemas es consciente de sus obligaciones en materia de confidencialidad y seguridad.",
        "privacy_security_p2": "A pesar de nuestro compromiso y de la diligencia en la aplicación de estas medidas, es importante reconocer que ningún sistema de transmisión por Internet o de almacenamiento electrónico es infalible o 100% invulnerable. Sin embargo, nos comprometemos a mantener y mejorar continuamente nuestras prácticas de seguridad para adaptarnos a las nuevas amenazas y proteger sus datos con el mayor rigor posible.",
        "privacy_updates_title": "11. Modificaciones y Actualizaciones de la Política de Privacidad",
        "privacy_updates_p1": "El entorno digital, las tecnologías y, de forma muy relevante, las regulaciones sobre privacidad y protección de datos, están en un estado de evolución constante. Para asegurar que nuestras prácticas no solo cumplan con la normativa vigente, sino que también se mantengan alineadas con los más altos estándares de protección y transparencia, ProjectNocturne se reserva el derecho de modificar, enmendar o actualizar la presente Política de Privacidad en cualquier momento y a su entera discreción.",
        "privacy_updates_p2": "Cualquier modificación realizada será efectiva de forma inmediata tras su publicación en esta misma página. Nos comprometemos a que cada versión de la política indique de manera clara y visible la fecha de \"Última Actualización\" en la parte superior del documento. Este mecanismo le permitirá identificar fácilmente si se han producido cambios desde su última revisión, fomentando una relación transparente.",
        "privacy_updates_p3": "Le recomendamos encarecidamente que revise esta página de forma periódica para mantenerse informado sobre cómo protegemos su información. La continuación en el uso de la Plataforma tras la publicación de dichas modificaciones constituirá su reconocimiento y aceptación de la política revisada. En el caso de que se introduzcan cambios de carácter sustancial que pudieran afectar de manera significativa sus derechos o la forma en que tratamos su información, procuraremos emplear métodos de notificación adicionales o más directos, siempre que sea posible y proporcionado, para asegurar su debido conocimiento.",
        "privacy_contact_title": "12. Contacto y Vías para el Ejercicio de Derechos",
        "privacy_contact_p1": "Su opinión es fundamental para nosotros, y la comunicación abierta es un pilar de nuestra filosofía de servicio. Estamos a su completa disposición para resolver cualquier duda, inquietud o solicitud de información que pueda surgir en relación con esta Política de Privacidad, nuestras prácticas de tratamiento de datos o cualquier otro aspecto relacionado con su privacidad en nuestra Plataforma.",
        "privacy_contact_p2": "Si desea ejercer cualquiera de sus derechos de Acceso, Rectificación, Cancelación u Oposición (ARCO), o si simplemente desea obtener una mayor clarificación sobre algún punto, le invitamos a utilizar nuestro canal de comunicación oficial. Puede ponerse en contacto con nuestro equipo a través del <strong><a href=\"#\" data-action=\"submit-feedback\" class=\"legal-link\">formulario de comentarios</a></strong> disponible directamente en la Plataforma.",
        "privacy_contact_p3": "Nos comprometemos a acusar recibo de su comunicación, a gestionar su solicitud con la debida diligencia y profesionalidad, y a responderle en los plazos legalmente establecidos, proporcionándole toda la asistencia necesaria para garantizar que tenga un control efectivo y transparente sobre su información.",
        "terms_title": "Términos y Condiciones de Uso de ProjectNocturne",
        "terms_last_updated": "Última Actualización:",
        "terms_intro_title": "1. Aceptación y Alcance de los Términos",
        "terms_intro_p1": "Estos Términos y Condiciones ('Términos') constituyen un <strong>acuerdo legalmente vinculante</strong> entre usted ('Usuario', 'usted') y el propietario y operador de ProjectNocturne ('nosotros', 'nuestro'). Estos Términos rigen su acceso y uso de la aplicación web ProjectNocturne, incluyendo todas sus herramientas, funcionalidades, contenido y servicios (colectivamente, el 'Servicio'). Al acceder, navegar o utilizar el Servicio de cualquier manera, usted confirma que ha leído, entendido y <strong>acepta estar legalmente obligado</strong> por estos Términos y por nuestra Política de Privacidad, que se incorpora aquí como referencia. Si no está de acuerdo con la totalidad de estos Términos, debe <strong>cesar inmediatamente todo uso</strong> del Servicio.",
        "terms_intro_p2": "Nos reservamos el <strong>derecho exclusivo</strong>, a nuestra <strong>entera discreción</strong>, de modificar, añadir o eliminar porciones de estos Términos en cualquier momento y sin previo aviso. Es su responsabilidad revisar estos Términos periódicamente. Su uso continuado del Servicio después de la publicación de las modificaciones constituirá su <strong>aceptación vinculante</strong> de dichos cambios.",
        "terms_service_desc_title": "2. Descripción y Naturaleza del Servicio",
        "terms_service_desc_p1": "ProjectNocturne es una aplicación web que proporciona un conjunto de herramientas de productividad y gestión del tiempo. El Servicio está diseñado para ser una utilidad personal y se ofrece bajo los principios de <strong>'TAL CUAL'</strong> y <strong>'SEGÚN DISPONIBILIDAD'</strong>.",
        "terms_service_desc_p2": "Usted reconoce y acepta expresamente que el funcionamiento del Servicio, en particular las notificaciones de sus funcionalidades, depende de <strong>factores externos que están fuera de nuestro control</strong>. Estos factores incluyen, entre otros, la estabilidad de su conexión a Internet, la versión y configuración de su navegador web, los permisos de notificación que usted otorga, y las políticas de gestión de energía y procesos en segundo plano de su sistema operativo. <strong>No garantizamos</strong> la entrega puntual o la ejecución de ninguna notificación o alerta.",
        "terms_service_desc_p3": "Todas las configuraciones y personalizaciones se almacenan <strong>localmente en su navegador</strong>. Usted es el <strong>único y total responsable</strong> de la gestión de estos datos. Cualquier acción que resulte en la limpieza de la caché de su navegador o de los datos del sitio resultará en la <strong>pérdida permanente e irrecuperable</strong> de todas sus configuraciones. <strong>No tenemos acceso ni control</strong> sobre estos datos locales.",
        "terms_user_responsibilities_title": "3. Obligaciones y Responsabilidades Fundamentales del Usuario",
        "terms_user_responsibilities_intro": "Al utilizar el Servicio, usted asume la <strong>total responsabilidad</strong> por sus acciones y por el uso que le da a las herramientas. Usted se compromete a:",
        "terms_user_resp_li1": "<strong>Uso Adecuado y No Crítico:</strong> Utilizar el Servicio de manera responsable. Usted entiende y acepta explícitamente que ProjectNocturne es una herramienta de conveniencia y <strong>bajo ninguna circunstancia</strong> debe ser utilizada o considerada fiable para situaciones <strong>críticas, profesionales, de emergencia, médicas o comerciales</strong> donde un fallo, retraso o inexactitud podría resultar en daños graves. La <strong>fiabilidad de las funcionalidades no está garantizada</strong>.",
        "terms_user_resp_li2": "<strong>Contenido Cargado y Derechos de Autor:</strong> El Servicio le permite cargar sus propios archivos de audio para usarlos como sonidos de notificación ('Contenido de Usuario'). Al cargar cualquier Contenido de Usuario, usted <strong>afirma, representa y garantiza</strong> que: (i) es el <strong>único creador y propietario</strong> de dicho contenido, o que posee todos los <strong>derechos, licencias y permisos necesarios</strong>; y que (ii) su contenido <strong>no infringe derechos de terceros</strong>. Usted es el <strong>único y exclusivo responsable</strong> de su Contenido de Usuario. Si recibimos una notificación de infracción de derechos de autor, nos comprometemos a <strong>cooperar con los procedimientos legales</strong> correspondientes.",
        "terms_user_resp_li3": "<strong>Seguridad del Entorno Propio:</strong> Asegurar que su sistema (dispositivo, sistema operativo y navegador) está <strong>configurado correctamente</strong> para permitir el funcionamiento del Servicio, incluyendo los permisos de notificación. Es su responsabilidad asegurarse de que su software de seguridad no interfieran con el Servicio.",
        "terms_user_resp_li4": "<strong>Gestión de Datos Locales:</strong> Reconocer y aceptar que la pérdida de sus configuraciones personales debido a acciones en su propio dispositivo es de su <strong>exclusiva responsabilidad</strong> y no puede ser atribuida a un fallo del Servicio.",
        "terms_prohibited_conduct_title": "4. Conducta Específicamente Prohibida",
        "terms_prohibited_conduct_intro": "Su permiso para usar el Servicio está condicionado a su cumplimiento estricto de las reglas de conducta. El Servicio es una utilidad diseñada para la productividad personal; cualquier uso fuera de este ámbito que comprometa la integridad de la plataforma o de otros usuarios está estrictamente prohibido. Las siguientes actividades constituyen un incumplimiento material de estos Términos:",
        "terms_prohibited_li1": "<strong>Ingeniería Inversa y Ataques a la Integridad:</strong> Realizar, o intentar realizar, cualquier forma de ingeniería inversa, descompilación, desensamblaje o descubrimiento del <strong>código fuente, arquitectura, o algoritmos</strong> del Servicio. Esto incluye cualquier intento de eludir medidas de seguridad o de control de acceso.",
        "terms_prohibited_li2": "<strong>Uso de Sistemas Automatizados y Sobrecarga:</strong> Utilizar cualquier sistema automatizado, como <strong>'robots', 'spiders', 'scrapers' o scripts</strong>, para acceder, monitorear, o interactuar con el Servicio de una manera que imponga una <strong>carga irrazonable o desproporcionadamente grande</strong> en nuestra infraestructura, o que esté diseñada para extraer datos o contenido de forma masiva.",
        "terms_prohibited_li3": "<strong>Carga de Contenido Malicioso o Ilegal:</strong> Cargar, transmitir o almacenar cualquier archivo de audio que contenga <strong>virus, gusanos, troyanos, ransomware</strong>, o cualquier otro código malicioso. Asimismo, está prohibido cargar contenido que sea ilegal, difamatorio, acosador, o que incite a la violencia o al odio.",
        "terms_prohibited_li4": "<strong>Interferencia del Servicio:</strong> Intentar activamente interferir con el funcionamiento adecuado del Servicio, incluyendo, pero no limitado a, <strong>probar vulnerabilidades, realizar ataques de denegación de servicio (DoS)</strong>, o comprometer de cualquier forma la <strong>integridad y seguridad</strong> de nuestros sistemas y redes.",
        "terms_prohibited_li5": "<strong>Abuso de Canales de Comunicación:</strong> Utilizar el formulario de contacto para enviar <strong>spam, mensajes no solicitados, publicidad no autorizada</strong>, o cualquier forma de comunicación masiva, abusiva o fraudulenta.",
        "terms_prohibited_li6": "<strong>Uso Ilegal General:</strong> Utilizar el Servicio para cualquier propósito que viole leyes o regulaciones locales, estatales, nacionales o internacionales.",
        "terms_ip_title": "5. Propiedad Intelectual",
        "terms_ip_p1": "El Servicio, incluyendo su código fuente, arquitectura, diseño, 'look and feel', texto, gráficos, imágenes, logotipos, clips de audio predeterminados, y todo el contenido generado por nosotros (colectivamente, el 'Contenido de ProjectNocturne'), así como la selección y disposición de los mismos, son <strong>propiedad exclusiva</strong> de ProjectNocturne y están protegidos por las leyes de <strong>derechos de autor y secretos comerciales</strong> a nivel internacional.",
        "terms_ip_p2": "Le otorgamos una <strong>licencia limitada, personal, no exclusiva, intransferible y revocable</strong> para acceder y utilizar el Servicio estrictamente para su uso personal y funcional, sujeta a su cumplimiento de estos Términos. Esta licencia no le otorga <strong>ningún derecho de propiedad</strong> sobre el Servicio o el Contenido de ProjectNocturne.",
        "terms_ip_p3": "Cualquier uso del Servicio o del Contenido de ProjectNocturne no autorizado en este documento está <strong>estrictamente prohibido</strong> y resultará en la terminación inmediata de la licencia otorgada. Nada en estos Térmicos se interpretará como la concesión de ninguna licencia sobre derechos de propiedad intelectual.",
        "terms_disclaimers_title": "6. EXCLUSIÓN DE GARANTÍAS Y DESCARGOS DE RESPONSABILIDAD",
        "terms_disclaimers_p1": "USTED ENTIENDE Y ACEPTA EXPRESAMENTE QUE SU USO DEL SERVICIO ES <strong>BAJO SU PROPIO RIESGO</strong>. EL SERVICIO SE PROPORCIONA <strong>'TAL CUAL' Y 'SEGÚN DISPONIBILIDAD'</strong>. PROJECTNOCTURNE RENUNCIA EXPRESAMENTE A <strong>TODAS LAS GARANTÍAS</strong> DE CUALQUIER TIPO, YA SEAN EXPRESAS O IMPLÍCITAS.",
        "terms_disclaimers_p2": "<strong>NO GARANTIZAMOS</strong> QUE EL SERVICIO SERÁ ININTERRUMPIDO, OPORTUNO, SEGURO O LIBRE DE ERRORES. NO GARANTIZAMOS QUE LAS ALERTAS O NOTIFICACIONES FUNCIONARÁN CORRECTAMENTE EN TODO MOMENTO. LA FUNCIONALIDAD DEL SERVICIO PUEDE VERSE AFECTADA NEGATIVAMENTE POR CONDICIONES FUERA DE NUESTRO CONTROL.",
        "terms_disclaimers_p3": "<strong>NO GARANTIZAMOS</strong> QUE LOS RESULTADOS QUE SE PUEDAN OBTENER DEL USO DEL SERVICIO, COMO LA PRECISIÓN DE SUS FUNCIONALIDADES DE TIEMPO, SEAN <strong>EXACTOS O CONFIABLES</strong>. USTED ACEPTA QUE PODEMOS ELIMINAR EL SERVICIO POR PERÍODOS INDEFINIDOS O CANCELARLO EN CUALQUIER MOMENTO, SIN PREVIO AVISO.",
        "terms_liability_title": "7. LIMITACIÓN DE RESPONSABILIDAD",
        "terms_liability_p1": "EN LA <strong>MÁXIMA MEDIDA PERMITIDA POR LA LEY APLICABLE</strong>, EN NINGÚN CASO PROJECTNOCTURNE, SUS AFILIADOS, DIRECTORES, EMPLEADOS, AGENTES O LICENCIANTES SERÁN RESPONSABLES DE NINGÚN DAÑO <strong>DIRECTO, INDIRECTO, PUNITIVO, INCIDENTAL, ESPECIAL, CONSECUENTE O EJEMPLAR</strong>.",
        "terms_liability_p2": "BAJO <strong>NINGUNA CIRCUNSTANCIA</strong> SEREMOS RESPONSABLES DE CUALQUIER DAÑO, PÉRDIDA O LESIÓN RESULTANTE DE LA PIRATERÍA, MANIPULACIÓN U OTRO ACCESO O USO NO AUTORIZADO DEL SERVICIO.",
        "terms_indemnification_title": "8. Indemnización",
        "terms_indemnification_p1": "Usted acepta <strong>defender, indemnizar y eximir de toda responsabilidad</strong> a ProjectNocturne de y contra cualquier reclamación, daño, obligación, pérdida, y gastos (incluidos honorarios de abogados) que surjan de: (i) su uso del Servicio; (ii) su <strong>violación de cualquier término</strong> de estos Términos; o (iii) su <strong>violación de cualquier derecho de terceros</strong>, especialmente en relación con su Contenido de Usuario.",
        "terms_termination_title": "9. Terminación y Suspensión del Acceso",
        "terms_termination_intro": "Nos reservamos el derecho de terminar o suspender su acceso al Servicio bajo diversas circunstancias, con el fin de proteger la integridad, seguridad y operatividad de la plataforma. La terminación puede ocurrir a nuestra entera discreción, con o sin previo aviso. Las causas para la terminación incluyen, pero no se limitan a, las siguientes:",
        "terms_termination_li1": "<strong>Incumplimiento Material de los Términos:</strong> Si usted incumple cualquiera de las disposiciones establecidas en estos Términos y Condiciones, especialmente las relativas a la Conducta Prohibida (Sección 4).",
        "terms_termination_li2": "<strong>Actividad Ilegal o Fraudulenta:</strong> Si tenemos motivos razonables para sospechar que ha utilizado el Servicio para cualquier propósito ilegal, fraudulento, malicioso o no autorizado que ponga en riesgo a la plataforma o a sus usuarios.",
        "terms_termination_li3": "<strong>Riesgo para el Servicio o Terceros:</strong> Si su uso del Servicio, a nuestra entera discreción, representa un riesgo técnico, de seguridad o de reputación para ProjectNocturne o para otros usuarios.",
        "terms_termination_p1": "Podemos ejercer nuestro derecho a <strong>terminar o suspender su acceso</strong> a todo o parte del Servicio de inmediato, <strong>sin previo aviso ni responsabilidad</strong> alguna. La decisión de lo que constituye un motivo para la terminación recae exclusivamente en nosotros.",
        "terms_termination_p2": "Tras la terminación de su acceso, su derecho a utilizar el Servicio <strong>cesará inmediatamente</strong>. Usted puede dejar de usar el Servicio en cualquier momento por su propia voluntad, lo que no le exime de las obligaciones contraídas bajo estos Términos antes de su cese. Todas las disposiciones de los Términos que, por su naturaleza, deban sobrevivir a la terminación, <strong>sobrevivirán</strong>, incluyendo, sin limitación, las disposiciones de propiedad intelectual, las exclusiones de garantías, la indemnización y las limitaciones de responsabilidad.",
        "terms_governing_law_title": "10. Ley Aplicable, Jurisdicción y Resolución de Disputas",
        "terms_governing_law_p1": "Estos Términos se regirán e interpretarán de acuerdo con las <strong>leyes de la jurisdicción</strong> en la que el propietario de ProjectNocturne está domiciliado, sin dar efecto a ningún principio de conflicto de leyes. Usted acepta que cualquier acción legal que surja de estos Términos se presentará solo en los tribunales ubicados en dicha jurisdicción, y por la presente consiente y se somete a la <strong>jurisdicción personal y exclusiva</strong> de dichos tribunales.",
        "terms_governing_law_p2": "Antes de iniciar cualquier acción legal formal, usted acepta intentar resolver cualquier disputa de <strong>manera informal</strong>. Puede contactarnos a través de los canales proporcionados. Si una disputa no se resuelve dentro de <strong>sesenta (60) días</strong>, cualquiera de las partes puede iniciar un procedimiento formal.",
        "terms_governing_law_p3": "EN LA MEDIDA MÁXIMA PERMITIDA POR LA LEY, USTED Y PROJECTNOCTURNE ACEPTAN PRESENTAR RECLAMACIONES CONTRA EL OTRO SOLO EN SU <strong>CAPACIDAD INDIVIDUAL</strong>, Y NO COMO DEMANDANTE O MIEMBRO DE UNA <strong>ACCIÓN COLECTIVA</strong>. Además, cualquier reclamación debe presentarse dentro de <strong>un (1) año</strong> después de que surgió la causa de la acción, o quedará <strong>permanentemente prescrita</strong>.",
        "terms_general_title": "11. Disposiciones Generales",
        "terms_general_p1": "<strong>Acuerdo Completo:</strong> Estos Términos, junto con la Política de Privacidad, constituyen el acuerdo completo y exclusivo entre usted y ProjectNocturne con respecto al Servicio, y reemplazan todos los acuerdos y entendimientos anteriores, ya sean orales o escritos.",
        "terms_general_p2": "<strong>Divisibilidad:</strong> Si alguna disposición de estos Términos es considerada por un tribunal de jurisdicción competente como inválida o inaplicable, dicha disposición se interpretará para reflejar las intenciones originales de las partes, y las disposiciones restantes de los Términos permanecerán en pleno vigor y efecto.",
        "terms_general_p3": "<strong>No Renuncia:</strong> Nuestra incapacidad para ejercer o hacer cumplir cualquier derecho o disposición de estos Términos no constituirá una renuncia a dicho derecho o disposición. Ninguna renuncia a cualquier término de estos Términos se considerará una renuncia posterior o continua de dicho término o de cualquier otro.",
        "terms_general_p4": "<strong>Cesión:</strong> Usted no puede ceder ni transferir estos Términos, por ministerio de la ley o de otro modo, sin nuestro consentimiento previo por escrito. Cualquier intento por su parte de hacerlo, sin dicho consentimiento, será nulo y sin efecto. Nosotros podemos ceder o transferir libremente estos Términos sin restricción alguna.",
        "terms_contact_title": "12. Contacto e Informes",
        "terms_contact_p1": "Para cualquier pregunta general, informe de errores, o inquietudes relacionadas con estos Términos, el canal de comunicación oficial y preferido es nuestro <strong><a href=\"#\" data-action=\"submit-feedback\" class=\"legal-link\">Formulario de comentarios</a></strong> disponible directamente en la Plataforma. Nos esforzaremos por responder de manera oportuna. Este canal no debe utilizarse para notificaciones legales formales.",
        "cookies_title": "Política de Cookies de ProjectNocturne",
        "cookies_s1_title": "1. Preámbulo y Declaración de Principios",
        "cookies_s1_p1": "La presente Política de Cookies y Tecnologías de Almacenamiento Local (en adelante, \"la Política\") tiene como objetivo proporcionar una descripción exhaustiva y transparente sobre el uso de tecnologías de almacenamiento en el navegador por parte de la plataforma web ProjectNocturne (en adelante, \"el Servicio\"). Este documento complementa nuestra Política de Privacidad y nuestros Términos y Condiciones, centrándose de manera específica en los datos que se almacenan en el dispositivo del usuario para garantizar la funcionalidad, personalización y persistencia de la experiencia. Nuestra filosofía operativa se fundamenta en un pilar de máxima transparencia y respeto por la autonomía del usuario. En consonancia con este principio, declaramos de forma explícita que <strong>ProjectNocturne no utiliza cookies HTTP tradicionales para fines de seguimiento, publicitarias o de análisis de terceros.</strong> No implementamos mecanismos que rastreen su comportamiento fuera de nuestro dominio, ni compartimos información con redes publicitarias o corredores de datos. La elección de emplear tecnologías de almacenamiento local en lugar de cookies es una decisión de diseño deliberada, orientada a empoderar al usuario, garantizando que sus datos de configuración permanezcan bajo su control exclusivo. Nuestro uso de estas tecnologías se limita, de manera irrevocable, a fines estrictamente funcionales, los cuales son indispensables para la prestación de una experiencia de usuario robusta, coherente y altamente personalizada. La interacción y uso continuado del Servicio implica el conocimiento y la aceptación de las prácticas de almacenamiento local aquí descritas, las cuales son esenciales para la operatividad de la plataforma.",
        "cookies_s2_title": "2. Finalidades y Categorías de Datos Almacenados Localmente",
        "cookies_s2_p1": "El almacenamiento de datos en su navegador es un requisito técnico indispensable para que el Servicio pueda ofrecer sus funcionalidades principales. A continuación, se detallan las categorías de datos que se almacenan y sus finalidades específicas:",
        "cookies_s2_ss1_title": "2.1. Persistencia de la Configuración de Herramientas y Estado de la Aplicación",
        "cookies_s2_ss1_p1": "Para que el Servicio trascienda la naturaleza de una simple página web y se comporte como una aplicación persistente, es fundamental guardar el estado de sus interacciones. Almacenamos localmente toda la configuración que usted establece en nuestras herramientas para asegurar una continuidad sin interrupciones entre sesiones. Esto incluye las propiedades detalladas de las <strong>alarmas</strong> que crea, la configuración de duración y sonido de los <strong>temporizadores</strong>, la lista y personalización de los <strong>relojes mundiales</strong>, y el estado íntegro del <strong>cronómetro</strong>, incluyendo el tiempo transcurrido y el historial de vueltas. Sin este almacenamiento funcional, cualquier configuración se perdería de forma inmediata al cerrar o actualizar la pestaña, mermando la utilidad fundamental del Servicio.",
        "cookies_s2_ss2_title": "2.2. Personalización Avanzada de la Interfaz y Experiencia de Usuario",
        "cookies_s2_ss2_p1": "ProjectNocturne ofrece un alto grado de personalización para adaptarse a sus preferencias estéticas y de usabilidad. Para que esta personalización sea recordada y aplicada automáticamente en cada visita, guardamos localmente la selección de <strong>tema visual</strong> (claro, oscuro o sincronizado con el sistema), el <strong>idioma de la interfaz</strong>, así como sus <strong>preferencias de estilo tipográfico</strong>, como el color y los atributos de formato (negrita, cursiva) para los elementos textuales principales. Adicionalmente, se conserva un registro de los <strong>colores utilizados recientemente</strong> y el <strong>estado de visualización (plegado/desplegado)</strong> de los menús para optimizar la navegación y reducir la fricción en el uso recurrente.",
        "cookies_s2_ss3_title": "2.3. Gestión de Contenido Generado por el Usuario",
        "cookies_s2_ss3_p1": "El Servicio le permite ir más allá de las opciones predeterminadas al facilitar la carga de sus propios archivos de audio para las notificaciones. Para gestionar este contenido de forma segura y privada, utilizamos la tecnología <code>IndexedDB</code>. Esto significa que sus <strong>archivos de audio personalizados</strong> se almacenan en una base de datos local y segura dentro de su propio navegador. Subrayamos que estos archivos <strong>no son transferidos, alojados ni procesados en nuestros servidores</strong>; permanecen bajo su control exclusivo en su dispositivo.",
        "cookies_s2_ss4_title": "2.4. Optimización del Servicio Mediante Analítica Anónima",
        "cookies_s2_ss4_p1": "Para la mejora continua de ProjectNocturne, asignamos un <strong>identificador de sesión completamente anónimo</strong> a su navegador. Este identificador no contiene información personal y no puede ser utilizado para su identificación. Su única finalidad es permitirnos agrupar eventos de interacción de forma agregada para realizar análisis de usabilidad internos, permitiéndonos tomar decisiones de desarrollo informadas, siempre desde una perspectiva de total anonimato.",
        "cookies_s3_title": "3. Gestión y Eliminación de Datos por Parte del Usuario",
        "cookies_s3_p1": "En concordancia con nuestra filosofía de empoderamiento, usted, como usuario, es el único custodio y administrador de los datos almacenados localmente en su dispositivo. Le conferimos el control absoluto para gestionar y eliminar esta información en cualquier momento. Al hacerlo, la aplicación se restablecerá a su estado original, como si fuera la primera vez que la visita.",
        "cookies_s3_p2": "Para eliminar los datos almacenados, debe utilizar las herramientas de limpieza de datos integradas en su navegador web. El procedimiento general es acceder a la <strong>Configuración</strong>, buscar la sección de <strong>\"Privacidad y seguridad\"</strong>, y seleccionar <strong>\"Borrar datos de navegación\"</strong>. Asegúrese de seleccionar el intervalo de tiempo \"Desde siempre\" y marcar la casilla correspondiente a <strong>\"Cookies y otros datos de sitios\"</strong>. Es importante comprender que esta acción es irreversible y eliminará todas sus configuraciones guardadas.",
        "cookies_s4_title": "4. Consentimiento Implícito para Funcionalidad Esencial",
        "cookies_s4_p1": "Al utilizar las diversas funcionalidades de ProjectNocturne, usted otorga su consentimiento implícito y está de acuerdo con el almacenamiento local de los datos funcionales descritos en esta política. Se debe entender que este almacenamiento no es opcional, sino que constituye un prerrequisito técnico <strong>estrictamente necesario</strong> para el correcto funcionamiento de las características de personalización y persistencia que definen la propuesta de valor fundamental del Servicio. Sin estas tecnologías, la plataforma no podría operar de la manera en que fue diseñada."
    }
}