{
    "legal_docs": {
        "home_title": "ProjectNocturne - Accueil",
        "terms_content": "Ceci est le contenu de vos termes et conditions. Vous pouvez le remplacer par votre texte réel.",
        "cookies_title": "Politique de Cookies",
        "cookies_content": "Ceci est le contenu de votre politique de cookies. Vous pouvez le remplacer par votre texte réel.",
        "privacy_title": "Politique de Confidentialité de ProjectNocturne",
        "privacy_last_updated": "Dernière Mise à Jour et Date d'Entrée en Vigueur:",
        "privacy_intro_title": "1. Introduction et Philosophie de Confidentialité",
        "privacy_intro_p1": "Nous vous souhaitons la bienvenue sur ProjectNocturne (ci-après, \"la Plateforme\" ou \"le Service\"). Notre objectif principal est d'offrir un écosystème d'outils numériques à haute productivité, conçus pour être puissants, intuitifs et profondément personnalisables. Nous comprenons que la relation avec nos utilisateurs repose sur la confiance, et par conséquent, notre engagement envers la protection, la sécurité et la transparence dans le traitement des données est un pilier fondamental et non négociable de notre fonctionnement.",
        "privacy_intro_p2": "<strong>Acceptation de la Politique :</strong> En utilisant ce site web, vous déclarez avoir lu, compris et accepté les termes et conditionsénoncés dans cette Politique de Confidentialité. Si vous n'êtes pas d'accord avec l'un des points énoncés ici, nous vous demandons de vous abstenir d'utiliser nos services.",
        "privacy_intro_p3": "Cette Politique de Confidentialité a été conçue pour être un document complet et accessible. Son objectif est de fournir une vision claire et sans ambiguïté de chaque catégorie de données que nous collectons, des finalités spécifiques et légitimes pour lesquelles elles sont traitées, des technologies sous-jacentes qui facilitent la fourniture de nos services et, de manière cruciale, des droits inaliénables que vous, en tant que propriétaire de vos données, possédez et pouvez exercer. L'utilisation continue et l'interaction avec la Plateforme impliquent la lecture, la compréhension et l'acceptation des pratiques opérationnelles décrites ici.",
        "privacy_definitions_title": "2. Définitions Clés",
        "privacy_definitions_intro": "Pour garantir une compréhension claire et précise de ce document, il est essentiel d'établir les définitions suivantes qui seront utilisées tout au long de cette politique :",
        "privacy_def_personal_data": "<strong>Données Personnelles :</strong> Désigne toute information qui, seule ou en combinaison avec d'autres données disponibles, permet l'identification directe ou indirecte d'une personne physique. Dans le contexte spécifique de ProjectNocturne, et en application stricte du principe de minimisation, la seule donnée personnelle que nous pourrions traiter est votre <strong>adresse e-mail</strong>, et cela ne se produit que lorsque vous décidez de la fournir volontairement via nos formulaires de contact ou de suggestion.",
        "privacy_def_usage_telemetry": "<strong>Données d'Utilisation et de Télémétrie :</strong> Correspond à toutes les informations générées et collectées automatiquement lors de votre interaction avec la Plateforme. Il est important de noter que ces données sont anonymes et ne sont pas liées à votre identité personnelle. Elles comprennent, entre autres, l'<strong>identifiant de session anonyme (UUID)</strong> pour distinguer les sessions d'utilisation sans identifier l'utilisateur, les <strong>événements d'interaction</strong> (tels que les clics sur des fonctions spécifiques) pour l'analyse de l'utilisabilité, et les <strong>métadonnées techniques</strong> telles que le type de navigateur, le système d'exploitation et le pays d'origine, afin d'optimiser la compatibilité et les performances.",
        "privacy_def_user": "<strong>Utilisateur :</strong> Est toute personne physique qui, librement et volontairement, accède, navigue ou utilise l'un des outils et fonctionnalités offerts par la Plateforme ProjectNocturne via son domaine web.",
        "privacy_def_controller": "<strong>Responsable du Traitement :</strong> Est l'entité qui, seule ou conjointement avec d'autres, prend les décisions fondamentales concernant le traitement des données personnelles, y compris la détermination des finalités (le \"pourquoi\") et des moyens (le \"comment\"). À toutes fins légales et pratiques, <strong>ProjectNocturne</strong> est le seul et unique Responsable du Traitement des données couvertes par cette politique.",
        "privacy_controller_role_title": "3. Identification et Rôle du Responsable du Traitement des Données",
        "privacy_controller_role_p1": "Dans le cadre de la législation applicable en matière de protection des données, tant au niveau national qu'international, le \"Responsable du Traitement\" est défini comme la personne physique ou morale qui, seule ou conjointement avec d'autres, détermine les finalités et les moyens du traitement des données personnelles.",
        "privacy_controller_role_p2": "À toutes fins légales et de transparence, il est établi que <strong>ProjectNocturne</strong>, en tant qu'entité numérique accessible via son domaine web officiel, agit en tant que seul et unique Responsable du Traitement de toutes les données personnelles et données d'utilisation collectées et traitées via les interactions des utilisateurs avec la Plateforme.",
        "privacy_controller_role_p3": "Cette responsabilité implique un devoir de diligence active qui va de la définition des politiques de confidentialité et de la mise en œuvre des mesures de sécurité, à la garantie de l'exercice effectif des droits des utilisateurs. En tant que Responsable du Traitement, ProjectNocturne s'engage à assurer que l'ensemble du cycle de vie des données — de la collecte à la suppression éventuelle — est géré conformément aux principes de licéité, de loyauté, de transparence, de minimisation et de confidentialité établis ici. Toute question concernant le traitement de vos données doit être adressée aux canaux de contact spécifiés dans ce document.",
        "privacy_principles_title": "4. Principes Directeurs du Traitement des Données",
        "privacy_principles_intro": "Notre engagement envers votre vie privée est absolu. Par conséquent, toutes nos activités de traitement des données sont régies par les principes fondamentaux suivants, qui constituent le pilier de notre cadre éthique et opérationnel, garantissant une gestion juste, transparente et conforme aux meilleures pratiques internationales :",
        "privacy_principles_lft": "<strong>Licéité, Loyauté et Transparence :</strong> Tout traitement de données que nous effectuons est fondé sur une base juridique solide et clairement définie dans cette politique. Nous agissons avec la plus grande loyauté envers nos utilisateurs, ce qui signifie que nous ne traiterons jamais vos données de manière que vous ne pourriez raisonnablement pas attendre. La transparence est essentielle : nous vous informons de manière claire et accessible sur les données que nous collectons et l'usage que nous en faisons.",
        "privacy_principles_purpose": "<strong>Limitation des Finalités :</strong> Les données que nous collectons sont utilisées uniquement et exclusivement aux fins explicites et légitimes détaillées dans la section 6 de cette politique. Nous nous engageons à ne pas traiter vos données à des fins ultérieures incompatibles avec celles pour lesquelles elles ont été initialement collectées, garantissant ainsi que les informations sont utilisées de manière prévisible et respectueuse.",
        "privacy_principles_minimization": "<strong>Minimisation des Données :</strong> Nous adoptons une approche de \"confidentialité dès la conception et par défaut\". Cela signifie que nous ne collectons que la quantité minimale d'informations strictement nécessaire, adéquate et pertinente pour chaque finalité spécifique. Nous ne demandons ni ne collectons de données qui ne sont pas indispensables au fonctionnement et à l'amélioration de la Plateforme.",
        "privacy_principles_security": "<strong>Intégrité et Confidentialité :</strong> La sécurité de vos données est une priorité essentielle. Nous mettons en œuvre et maintenons un ensemble robuste de mesures de sécurité techniques et organisationnelles, telles que le chiffrement des communications et des contrôles d'accès stricts, pour protéger toutes les informations contre tout traitement non autorisé ou illicite, ainsi que contre leur perte, destruction ou dommage accidentel.",
        "privacy_data_types_title": "5. Types de Données Collectées et Canaux de Collecte",
        "privacy_data_types_intro": "La fonctionnalité de la Plateforme nécessite la collecte de différentes catégories de données, qui sont détaillées ci-dessous pour votre information complète :",
        "privacy_data_types_local_title": "<strong>5.1. Données de Fonctionnalité Essentielle (Stockage Local du Navigateur) :</strong>",
        "privacy_data_types_local_p1": "Pour que ProjectNocturne soit un outil vraiment utile et personnalisé, nous nous appuyons sur les technologies de stockage local de votre navigateur (`localStorage` et `IndexedDB`). Cette approche décentralisée vous donne, à vous l'utilisateur, un contrôle direct et souverain sur vos données de configuration. Les informations stockées localement comprennent :",
        "privacy_data_types_local_li1": "<strong>Configuration des Outils (localStorage) :</strong> Nous stockons de manière persistante la configuration de chaque alarme, minuteur et horloge mondiale que vous créez. Cela inclut les titres, les heures, les sons sélectionnés et les états de fonctionnement.",
        "privacy_data_types_local_li2": "<strong>Préférences d'Interface (localStorage) :</strong> Nous enregistrons vos choix de personnalisation, tels que le thème visuel (clair/sombre), la couleur du texte et l'échelle de la police, afin que l'interface s'adapte à vos goûts à chaque visite.",
        "privacy_data_types_local_li3": "<strong>Fichiers Audio Personnalisés (IndexedDB) :</strong> Si vous utilisez la fonction de téléchargement de vos propres sons pour les alertes, ces fichiers sont enregistrés dans la base de données `IndexedDB` de votre navigateur. Il s'agit d'un stockage local et privé sur votre machine ; ces fichiers ne sont jamais transférés sur nos serveurs.",
        "privacy_data_types_user_title": "<strong>5.2. Données Fournies Directement par l'Utilisateur :</strong>",
        "privacy_data_types_user_li1": "<strong>Formulaire de Suggestions et d'Améliorations :</strong> Lorsque vous nous contactez via le formulaire de suggestions, nous collectons les données que vous nous fournissez volontairement : votre <strong>adresse e-mail</strong>, la <strong>catégorie de vos commentaires</strong> et le <strong>contenu de votre message</strong>.",
        "privacy_data_types_telemetry_title": "<strong>5.3. Données d'Utilisation et de Télémétrie Anonymes :</strong>",
        "privacy_data_types_telemetry_p1": "Pour améliorer la Plateforme, nous collectons des données d'utilisation de manière anonyme, qui ne permettent pas votre identification personnelle :",
        "privacy_data_types_telemetry_li1": "<strong>Identifiant de Session Unique (UUID) :</strong> Nous attribuons un identifiant anonyme à votre navigateur (`user-unique-id`) pour regrouper les métriques d'utilisation sans collecter d'informations personnelles.",
        "privacy_data_types_telemetry_li2": "<strong>Télémétrie d'Événements :</strong> Nous enregistrons les interactions anonymes clés avec les fonctionnalités de la plateforme. Ces données sont cruciales pour notre analyse de l'utilisabilité et pour comprendre quels outils sont les plus appréciés par nos utilisateurs.",
        "privacy_data_types_telemetry_li3": "<strong>Données Techniques et Géographiques :</strong> Nous détectons votre <strong>pays</strong> d'origine (sans stocker votre adresse IP), votre <strong>système d'exploitation</strong> et votre <strong>navigateur web</strong> pour optimiser la compatibilité et l'expérience.",
        "privacy_purposes_title": "6. Finalités Détaillées du Traitement des Données",
        "privacy_purposes_intro": "Le traitement de chaque catégorie de données poursuit des objectifs clairs, définis et légitimes, visant exclusively à la fourniture et à l'amélioration continue de nos services. Ces finalités sont détaillées ci-dessous :",
        "privacy_purposes_op": "<strong>Pour le Fonctionnement et la Maintenance du Service :</strong> Le stockage local de vos paramètres et préférences est fondamental pour la fonctionnalité principale de la Plateforme. Sans cette capacité, vos alarmes, minuteurs, horloges mondiales personnalisés et préférences de conception (thème, couleur, police) seraient perdus à chaque fois que vous fermez ou actualisez la page. Cette finalité est donc essentielle pour vous offrir une expérience utilisateur cohérente, persistante et véritablement personnalisée, ce qui est au cœur de notre proposition de valeur.",
        "privacy_purposes_imp": "<strong>Pour l'Amélioration Continue et l'Analyse Stratégique :</strong> La collecte de données de télémétrie et d'utilisation anonymes est un outil vital pour l'évolution de ProjectNocturne. Ces données agrégées nous permettent de comprendre comment les utilisateurs interagissent avec les différents outils, quelles sont les fonctions les plus utilisées et où peuvent exister des points de friction ou de difficulté. Cette analyse quantitative guide nos décisions de développement, nous aide à prioriser de nouvelles fonctionnalités, à optimiser les flux de travail existants et à garantir que nos ressources sont investies dans les domaines qui apportent le plus de valeur à notre communauté d'utilisateurs.",
        "privacy_purposes_comms": "<strong>Pour la Gestion des Communications et le Support Utilisateur :</strong> Lorsque vous nous envoyez vos commentaires, suggestions ou rapports de bogues via le formulaire de contact, nous utilisons les informations fournies (votre e-mail et le contenu de votre message) dans le seul but de gérer cette communication. Cela inclut le traitement de votre demande, l'enquête sur le problème signalé, la réponse à vos questions et, en général, la fourniture du support dont vous avez besoin. Nous n'utiliserons pas votre e-mail à des fins de marketing non sollicité.",
        "privacy_purposes_ux": "<strong>Pour la Personnalisation de l'Expérience Utilisateur :</strong> Au-delà des paramètres que vous enregistrez activement, la Plateforme effectue une détection initiale de facteurs tels que la langue de votre navigateur et les préférences de thème de votre système d'exploitation. Ces informations sont utilisées pour configurer automatiquement l'interface dans un état initial qui vous est familier et confortable dès le premier instant, réduisant ainsi le besoin d'ajustements manuels et rendant la Plateforme plus intuitive et adaptée à votre environnement numérique.",
        "privacy_legal_basis_title": "7. Base Juridique du Traitement",
        "privacy_legal_basis_intro": "Tout traitement de données que nous effectuons sur ProjectNocturne est fondé sur une base juridique solide et transparente, conformément aux principales réglementations en matière de protection des données, telles que le Règlement Général sur la Protection des Données (RGPD) de l'Union Européenne. Les bases juridiques qui légitiment nos activités de traitement sont les suivantes :",
        "privacy_legal_basis_consent": "<strong>Votre Consentement Explicite :</strong> Pour certaines activités de traitement, notre légitimité repose sur le consentement que vous nous donnez de manière libre, spécifique, informée et sans équivoque. C'est le cas lorsque vous décidez volontairement d'utiliser notre formulaire de suggestion et que vous nous fournissez votre adresse e-mail afin que nous puissions vous répondre. De même, en acceptant notre politique en matière de cookies et de confidentialité lors de l'utilisation du service, vous consentez aux pratiques décrites ici. Vous avez le droit de retirer votre consentement à tout moment, sans que cela n'affecte la licéité du traitement fondé sur le consentement avant son retrait.",
        "privacy_legal_basis_interest": "<strong>Notre Intérêt Légitime :</strong> Pour d'autres activités, la base juridique est notre intérêt légitime en tant qu'entreprise à exploiter et à améliorer notre service. Cela s'applique spécifiquement à la collecte de données d'utilisation et de télémétrie anonymes. Notre intérêt légitime consiste à comprendre comment notre Plateforme est utilisée afin de l'améliorer, de corriger les bogues et de prendre des décisions stratégiques concernant son développement futur. Nous avons effectué une mise en balance pour nous assurer que cet intérêt ne prévaut pas sur vos droits et libertés fondamentaux, d'autant plus que les données sont traitées de manière anonyme et ne permettent pas votre identification personnelle.",
        "privacy_retention_title": "8. Politique de Conservation et de Suppression des Données",
        "privacy_retention_intro": "Chez ProjectNocturne, nous appliquons une politique de conservation des données différenciée et transparente, conçue pour vous donner un contrôle maximal sur vos informations et pour nous assurer que nous ne stockons pas de données plus longtemps que ce qui est strictement nécessaire.",
        "privacy_retention_local": "<strong>Données Locales (`localStorage` et `IndexedDB`) :</strong> Cette catégorie de données, qui comprend tous les paramètres de vos outils et vos préférences d'interface, réside exclusivamente sur votre appareil, dans le stockage sécurisé de votre navigateur web. <strong>Vous avez le contrôle total et absolu sur ces données.</strong> Elles restent sur votre appareil indéfiniment pour garantir la persistance de votre expérience personnalisée à chaque visite de la Plateforme. La suppression de ces données est entièrement entre vos mains et peut être effectuée à tout moment via les outils de nettoyage des données de navigation proposés par votre navigateur (tels que \"Effacer les données de navigation\", \"Effacer l'historique\" ou similaire).",
        "privacy_retention_server": "<strong>Données du Serveur (Suggestions et Télémétrie) :</strong> Les informations transmises à nos serveurs, telles que les données de votre formulaire de suggestion (y compris votre e-mail) et la télémétrie d'utilisation anonyme, suivent un cycle de vie défini. Ces données ne sont conservées que pendant la période indispensable pour atteindre la finalité pour laquelle elles ont été collectées. Par exemple, nous conserverons les détails d'une suggestion jusqu'à ce qu'elle ait été traitée et qu'une réponse y ait été apportée. Une fois la finalité atteinte, ou si une période légale applicable expire, les données sont supprimées de manière sécurisée et permanente de nos systèmes.",
        "privacy_rights_title": "9. Droits de l'Utilisateur et Mécanismes d'Exercice",
        "privacy_rights_intro": "Chez ProjectNocturne, nous ne nous contentons pas de reconnaître, nous garantissons pleinement vos droits sur vos données personnelles, conformément aux normes les plus élevées en matière de protection des données. Vous avez le contrôle et pouvez exercer les droits suivants à tout moment :",
        "privacy_rights_access": "<strong>Droit d'Accès :</strong> Vous avez le droit d'obtenir la confirmation que des données personnelles vous concernant sont ou ne sont pas traitées par ProjectNocturne et, si tel est le cas, d'accéder à ces données. Cela inclut le droit de connaître les finalités du traitement, les catégories de données concernées et les destinataires des données. Étant donné que la seule donnée personnelle que nous stockons sur le serveur est votre adresse e-mail (si vous nous contactez), vous pouvez demander la confirmation de son existence et une copie de celle-ci.",
        "privacy_rights_rectification": "<strong>Droit de Rectification :</strong> Si vous estimez que les données personnelles que nous pourrions détenir à votre sujet (telles que votre adresse e-mail dans le cadre d'une communication) sont inexactes ou incomplètes, vous avez le droit d'en demander la correction sans délai excessif.",
        "privacy_rights_erasure": "<strong>Droit à l'Effacement ('Droit à l'Oubli') :</strong> Vous avez le droit de demander la suppression de vos données personnelles. Cela s'applique à la fois aux données stockées localement dans votre navigateur (que vous pouvez supprimer directement via les options de nettoyage de votre navigateur) et aux données que nous pourrions avoir sur nos serveurs (telles que votre e-mail après une demande). Dès réception de votre demande, nous procéderons à la suppression sécurisée de vos informations, à condition qu'il n'existe aucune obligation légale nous en empêchant.",
        "privacy_rights_objection": "<strong>Droit à la Limitation et à l'Opposition du Traitement :</strong> Dans certaines circonstances, vous avez le droit de demander la limitation du traitement de vos données ou de vous opposer à ce traitement. Par exemple, vous pouvez vous opposer à ce que vos données (adresse e-mail) continuent d'être traitées après la résolution d'une demande. Nous respecterons votre demande et cesserons le traitement, sauf pour des motifs légitimes impérieux ou pour la constatation, l'exercice ou la défense de droits en justice.",
        "privacy_security_title": "10. Mesures de Sécurité Mises en Œuvre",
        "privacy_security_intro": "La protection et l'intégrité des informations que vous nous confiez, ainsi que des données d'utilisation que nous traitons, constituent une priorité de la plus haute importance pour ProjectNocturne. Nous comprenons la responsabilité que cela implique et, par conséquent, nous avons mis en œuvre un cadre de sécurité multicouche, en adoptant des mesures de sécurité techniques et organisationnelles robustes, conçues pour atténuer les risques d'accès non autorisé, d'altération, de divulgation ou de destruction accidentelle ou illicite des données.",
        "privacy_security_p1": "Notre stratégie de sécurité couvre les domaines clés suivants :",
        "privacy_security_li1": "<strong>Sécurité de la Transmission des Données :</strong> Toute communication entre votre navigateur et nos serveurs, en particulier celle impliquant la transmission de données sensibles comme celles du formulaire de suggestion, s'effectue via des canaux sécurisés utilisant des protocoles de chiffrement standard de l'industrie (tels que TLS/SSL). Cela garantit que les informations voyagent sur le réseau de manière confidentielle et intègre.",
        "privacy_security_li2": "<strong>Sécurité du Stockage :</strong> Les données hébergées sur notre infrastructure de serveur, telles que la télémétrie anonyme et les suggestions, sont stockées dans des bases de données avec des contrôles d'accès stricts. L'accès à ces bases de données est exclusivamente limité au personnel autorisé qui a besoin de connaître les informations pour l'exercice de ses fonctions, en suivant le principe du moindre privilège.",
        "privacy_security_li3": "<strong>Sécurité au Niveau de l'Application :</strong> Notre plateforme est développée en suivant les meilleures pratiques de codage sécurisé pour prévenir les vulnérabilités courantes. Nous effectuons des examens réguliers de notre code et de nos dépendances pour identifier et atténuer les failles de sécurité potentielles.",
        "privacy_security_li4": "<strong>Sécurité Opérationnelle :</strong> Nous avons des politiques internes de gestion de la sécurité de l'information qui régissent l'accès, la manipulation et la protection des données. Le personnel ayant accès aux systèmes est conscient de ses obligations en matière de confidentialité et de sécurité.",
        "privacy_security_p2": "Malgré notre engagement et notre diligence dans l'application de ces mesures, il est important de reconnaître qu'aucun système de transmission sur Internet ou de stockage électronique n'est infaillible ou 100% invulnérable. Cependant, nous nous engageons à maintenir et à améliorer continuellement nos pratiques de sécurité pour nous adapter aux nouvelles menaces et protéger vos données avec la plus grande rigueur possible.",
        "privacy_updates_title": "11. Modifications et Mises à Jour de la Politique de Confidentialité",
        "privacy_updates_p1": "L'environnement numérique, les technologies et, de manera muy relevante, les réglementations sur la vie privée et la protection des données, sont en constante évolution. Pour garantir que nos pratiques non seulement respectent la réglementation en vigueur, mais restent également alignées sur les normes les plus élevées de protection et de transparence, ProjectNocturne se réserve le droit de modifier, d'amender ou de mettre à jour cette Politique de Confidentialité à tout moment et à sa seule discrétion.",
        "privacy_updates_p2": "Toute modification apportée prendra effet immédiatement après sa publication sur cette même page. Nous nous engageons à ce que chaque version de la politique indique de manière claire et visible la date de \"Dernière Mise à Jour\" en haut du document. Ce mécanisme vous permettra d'identifier facilement s'il y a eu des changements depuis votre dernière consultation, favorisant ainsi une relation transparente.",
        "privacy_updates_p3": "Nous vous encourageons vivement à consulter cette page périodiquement pour rester informé sur la manière dont nous protégeons vos informations. Votre utilisation continue de la Plateforme après la publication de ces modifications constituera votre reconnaissance et votre acceptation de la politique révisée. En cas de changements substantiels susceptibles d'affecter de manière significative vos droits ou la manière dont nous traitons vos informations, nous nous efforcerons d'utiliser des méthodes de notification supplémentaires ou plus directes, lorsque cela est possible et proportionné, pour assurer votre bonne information.",
        "privacy_contact_title": "12. Contact et Moyens d'Exercice des Droits",
        "privacy_contact_p1": "Votre opinion est fondamentale pour nous, et la communication ouverte est un pilier de notre philosophie de service. Nous sommes à votre entière disposition pour résoudre toute question, préoccupation ou demande d'information qui pourrait survenir concernant cette Politique de Confidentialité, nos pratiques de traitement des données, ou tout autre aspect lié à votre vie privée sur notre Plateforme.",
        "privacy_contact_p2": "Si vous souhaitez exercer l'un de vos droits d'Accès, de Rectification, d'Effacement ou d'Opposition, ou si vous souhaitez simplement obtenir plus de précisions sur un point, nous vous invitons à utiliser notre canal de communication officiel. Vous pouvez contacter notre équipe via le <strong><a href=\"#\" data-action=\"submit-feedback\" class=\"legal-link\">formulaire de commentaires</a></strong> disponible directement sur la Plateforme.",
        "privacy_contact_p3": "Nous nous engageons à accuser réception de votre communication, à gérer votre demande avec la diligence et le professionnalisme requis, et à vous répondre dans les délais légalement établis, en vous fournissant toute l'assistance nécessaire pour vous garantir un contrôle effectif et transparent sur vos informations.",
        "terms_title": "Conditions Générales d'Utilisation de ProjectNocturne",
        "terms_last_updated": "Dernière mise à jour:",
        "terms_intro_title": "1. Acceptation et Portée des Conditions",
        "terms_intro_p1": "Ces Conditions Générales ('Conditions') constituent un <strong>accord juridiquement contraignant</strong> entre vous ('Utilisateur', 'vous') et le propriétaire et exploitant de ProjectNocturne ('nous', 'notre'). Ces Conditions régissent votre accès et votre utilisation de l'application web ProjectNocturne, y compris tous ses outils, fonctionnalités, contenus et services (collectivement, le 'Service'). En accédant, naviguant ou utilisant le Service de quelque manière que ce soit, vous confirmez avoir lu, compris et <strong>accepter d'être légalement lié</strong> par ces Conditions et par notre Politique de Confidentialité, qui est incorporée ici par référence. Si vous n'êtes pas d'accord avec l'ensemble de ces Conditions, vous devez <strong>cesser immédiatement toute utilisation</strong> du Service.",
        "terms_intro_p2": "Nous nous réservons le <strong>droit exclusif</strong>, à notre <strong>seule discrétion</strong>, de modifier, d'ajouter ou de supprimer des portions de ces Conditions à tout moment et sans préavis. Il est de votre responsabilité de consulter périodiquement ces Conditions. Votre utilisation continue du Service après la publication des modifications constituera votre <strong>acceptation contraignante</strong> de ces changements.",
        "terms_service_desc_title": "2. Description et Nature du Service",
        "terms_service_desc_p1": "ProjectNocturne est une application web qui fournit une suite d'outils de productivité et de gestion du temps. Le Service est conçu comme un utilitaire personnel et est offert sur une base <strong>'TEL QUEL'</strong> et <strong>'SELON DISPONIBILITÉ'</strong>.",
        "terms_service_desc_p2": "Vous reconnaissez et acceptez expressément que le fonctionnement du Service, en particulier ses fonctionnalités de notification, dépend de <strong>facteurs externes hors de notre contrôle</strong>. Ces facteurs incluent, sans s'y limiter, la stabilité de votre connexion Internet, la version et la configuration de votre navigateur web, les autorisations de notification que vous accordez, et les politiques de gestion de l'énergie de votre système d'exploitation. Nous <strong>ne garantissons pas</strong> la livraison ponctuelle ou l'exécution de toute notification ou alerte.",
        "terms_service_desc_p3": "Toutes les configurations et personnalisations sont stockées <strong>localement dans votre navigateur</strong>. Vous êtes <strong>seul et entièrement responsable</strong> de la gestion de ces données. Toute action entraînant le nettoyage du cache de votre navigateur ou des données du site entraînera la <strong>perte permanente et irrécupérable</strong> de tous vos paramètres. Nous <strong>n'avons aucun accès ni contrôle</strong> sur ces données locales.",
        "terms_user_responsibilities_title": "3. Obligations et Responsabilités Fondamentales de l'Utilisateur",
        "terms_user_responsibilities_intro": "En utilisant le Service, vous assumez l'<strong>entière responsabilité</strong> de vos actions et de l'utilisation que vous faites des outils fournis. Vous vous engagez à:",
        "terms_user_resp_li1": "<strong>Utilisation Appropriée et Non Critique:</strong> Utiliser le Service de manière responsable. Vous comprenez et acceptez explicitement que ProjectNocturne est un outil de commodité et <strong>en aucun cas</strong> ne doit être utilisé ou considéré comme fiable pour des situations <strong>critiques, professionnelles, d'urgence, médicales ou commerciales</strong> où une défaillance, un retard ou une inexactitude pourrait entraîner des dommages graves. La <strong>fiabilité des fonctionnalités n'est pas garantie</strong>.",
        "terms_user_resp_li2": "<strong>Contenu Téléchargé et Droit d'Auteur:</strong> Si vous utilisez la fonctionnalité pour télécharger des fichiers audio personnalisés ('Contenu Utilisateur'), vous <strong>affirmez, représentez et garantissez</strong> que: (i) vous êtes le <strong>seul créateur et propriétaire</strong> de ce contenu, ou que vous possédez tous les <strong>droits, licences et autorisations nécessaires</strong>; et que (ii) votre contenu <strong>n'enfreint pas les droits de tiers</strong>. Vous êtes <strong>seul et exclusivamente responsable</strong> de votre Contenu Utilisateur. Si nous recevons une notification de violation du droit d'auteur, nous nous engageons à <strong>coopérer avec les procédures légales</strong> correspondantes.",
        "terms_user_resp_li3": "<strong>Sécurité de Votre Propre Environnement:</strong> Vous assurer que votre système (appareil, SE et navigateur) est <strong>correctement configuré</strong> pour permettre au Service de fonctionner, y compris les autorisations de notification. Il est de votre responsabilité de vous assurer que votre logiciel de sécurité n'interfère pas avec le Service.",
        "terms_user_resp_li4": "<strong>Gestion des Données Locales:</strong> Reconnaître et accepter que la perte de vos paramètres personnels due à des actions sur votre propre appareil est de votre <strong>responsabilité exclusive</strong> et ne peut être attribuée à une défaillance du Service.",
        "terms_prohibited_conduct_title": "4. Conduite Spécifiquement Interdite",
        "terms_prohibited_conduct_intro": "Votre permission d'utiliser le Service est conditionnée à votre strict respect des règles de conduite. Les activités suivantes sont <strong>strictement interdites</strong>:",
        "terms_prohibited_li1": "<strong>Ingénierie Inverse:</strong> Effectuer de l'ingénierie inverse, décompiler, désassembler ou tenter de découvrir le <strong>code source ou les algorithmes</strong> du Service.",
        "terms_prohibited_li2": "<strong>Utilisation de Systèmes Automatisés:</strong> Utiliser tout système automatisé, tel que des <strong>'robots' ou des 'spiders'</strong>, pour accéder, surveiller ou interagir avec le Service d'une manière qui impose une <strong>charge déraisonnable</strong> sur notre infrastructure.",
        "terms_prohibited_li3": "<strong>Téléchargement de Contenu Malveillant:</strong> Télécharger ou transmettre tout fichier audio contenant des <strong>virus, des vers, des chevaux de Troie</strong>, ou tout autre code malveillant.",
        "terms_prohibited_li4": "<strong>Interférence avec le Service:</strong> Tenter activement d'interférer avec le bon fonctionnement du Service ou de compromettre l'<strong>intégrité ou la sécurité</strong> de notre système.",
        "terms_prohibited_li5": "<strong>Abus des Canaux de Communication:</strong> Utiliser le formulaire de contact pour envoyer du <strong>spam, des messages non sollicités</strong>, ou toute forme de communication abusive.",
        "terms_prohibited_li6": "<strong>Utilisation Illégale Générale:</strong> Utiliser le Service à des fins qui violent les lois locales, étatiques, nationales ou internationales.",
        "terms_ip_title": "5. Propriété Intellectuelle",
        "terms_ip_p1": "Le Service, y compris son code source, sa conception, son 'look and feel', et tout notre contenu généré (le 'Contenu de ProjectNocturne'), sont la <strong>propriété exclusive</strong> de ProjectNocturne et sont protégés par les lois sur le <strong>droit d'auteur et les secrets commerciaux</strong> au niveau international.",
        "terms_ip_p2": "Nous vous accordons une <strong>licence limitée, personnelle, non exclusive, non transférable et révocable</strong> pour accéder et utiliser le Service strictement pour votre usage personnel et fonctionnel. Cette licence ne vous confère <strong>aucun droit de propriété</strong>.",
        "terms_ip_p3": "Toute utilisation du Service ou du Contenu de ProjectNocturne non autorisée par les présentes est <strong>strictement interdite</strong> et entraînera la résiliation immédiate de la licence accordée.",
        "terms_disclaimers_title": "6. EXCLUSION DE GARANTIES",
        "terms_disclaimers_p1": "VOUS COMPRENEZ ET ACCEPTEZ EXPRESSÉMENT QUE VOTRE UTILISATION DU SERVICE EST <strong>À VOS PROPRES RISQUES</strong>. LE SERVICE EST FOURNI <strong>'TEL QUEL' ET 'SELON DISPONIBILITÉ'</strong>. PROJECTNOCTURNE DÉCLINE EXPRESSÉMENT <strong>TOUTES LES GARANTIES</strong> DE QUELQUE NATURE QUE CE SOIT, EXPRESSES OU IMPLICITES.",
        "terms_disclaimers_p2": "<strong>NOUS NE GARANTISSONS PAS</strong> QUE LE SERVICE SERA ININTERROMPU, OPPORTUN, SÉCURISÉ OU SANS ERREUR. NOUS NE GARANTISSONS PAS QUE LES ALERTES OU NOTIFICATIONS FONCTIONNERONT CORRECTEMENT À TOUT MOMENT. LA FONCTIONNALITÉ DU SERVICE PEUT ÊTRE NÉGATIVEMENT AFFECTÉE PAR DES CONDITIONS HORS DE NOTRE CONTRÔLE.",
        "terms_disclaimers_p3": "<strong>NOUS NE GARANTISSONS PAS</strong> QUE LES RÉSULTATS POUVANT ÊTRE OBTENUS DE L'UTILISATION DU SERVICE, TELS QUE LA PRÉCISION DE SES FONCTIONNALITÉS LIÉES AU TEMPS, SERONT <strong>EXACTS OU FIABLES</strong>.",
        "terms_liability_title": "7. LIMITATION DE RESPONSABILITÉ",
        "terms_liability_p1": "DANS TOUTE LA MESURE PERMISE PAR LA LOI APPLICABLE, EN AUCUN CAS PROJECTNOCTURNE, SES AFFILIÉS, DIRIGEANTS, EMPLOYÉS, AGENTS OU CONCÉDANTS DE LICENCE NE SERONT RESPONSABLES DE TOUT DOMMAGE <strong>INDIRECT, PUNITIF, ACCESSOIRE, SPÉCIAL, CONSÉCUTIF OU EXEMPLAIRE</strong>.",
        "terms_liability_p2": "EN <strong>AUCUNE CIRCONSTANCE</strong> NOUS NE SERONS RESPONSABLES DE TOUT DOMMAGE, PERTE OU PRÉJUDICE RÉSULTANT DU PIRATAGE, DE L'ALTÉRATION OU DE TOUT AUTRE ACCÈS OU UTILISATION NON AUTORISÉ DU SERVICE.",
        "terms_indemnification_title": "8. Indemnisation",
        "terms_indemnification_p1": "Vous acceptez de <strong>défendre, d'indemniser et de dégager de toute responsabilité</strong> ProjectNocturne contre toute réclamation, dommage, obligation, perte et dépense (y compris les honoraires d'avocat) découlant de: (i) votre utilisation du Service; (ii) votre <strong>violation de toute condition</strong> de ces Conditions; ou (iii) votre <strong>violation de tout droit de tiers</strong>, notamment en ce qui concerne votre Contenu Utilisateur.",
        "terms_termination_title": "9. Résiliation et Suspension de l'Accès",
        "terms_termination_intro": "Nous nous réservons le droit de résilier ou de suspendre votre accès au Service pour diverses raisons, afin de protéger l'intégrité et la sécurité de la plateforme. La résiliation peut survenir à notre seule discrétion, avec ou sans préavis. Les motifs de résiliation incluent, sans s'y limiter:",
        "terms_termination_li1": "<strong>Violation Matérielle des Conditions:</strong> Si vous violez l'une des dispositions énoncées dans ces Conditions, en particulier celles relatives à la Conduite Interdite (Section 4).",
        "terms_termination_li2": "<strong>Activité Illégale ou Frauduleuse:</strong> Si nous avons des motifs raisonnables de soupçonner que vous avez utilisé le Service à des fins illégales, frauduleuses ou malveillantes.",
        "terms_termination_li3": "<strong>Risque pour le Service ou des Tiers:</strong> Si votre utilisation du Service, à notre seule discrétion, présente un risque technique, de sécurité ou de réputation pour ProjectNocturne.",
        "terms_termination_p1": "Nous pouvons exercer notre droit de <strong>résilier ou de suspendre votre accès</strong> immédiatement, <strong>sans préavis ni responsabilité</strong>. La décision de ce qui constitue un motif de résiliation nous appartient exclusivamente.",
        "terms_termination_p2": "Dès la résiliation, votre droit d'utiliser le Service <strong>cessera immédiatement</strong>. Toutes les dispositions des Conditions qui, par leur nature, devraient survivre à la résiliation, <strong>survivront</strong>, y compris les dispositions relatives à la propriété, les exclusions de garantie, l'indemnisation et les limitations de responsabilité.",
        "terms_governing_law_title": "10. Droit Applicable, Juridiction et Résolution des Litiges",
        "terms_governing_law_p1": "Ces Conditions seront régies et interprétées conformément aux <strong>lois de la juridiction</strong> dans laquelle le propriétaire de ProjectNocturne est domicilié. Vous acceptez de vous soumettre à la <strong>juridiction personnelle et exclusive</strong> des tribunaux situés dans cette juridiction.",
        "terms_governing_law_p2": "Avant d'intenter une action en justice, vous acceptez de tenter de résoudre tout litige avec nous de <strong>manière informelle</strong>. Si un litige n'est pas résolu dans les <strong>soixante (60) jours</strong> suivant sa soumission, l'une ou l'autre des parties peut engager une procédure formelle.",
        "terms_governing_law_p3": "DANS TOUTE LA MESURE PERMISE PAR LA LOI, VOUS ET PROJECTNOCTURNE ACCEPTEZ DE PRÉSENTER DES RÉCLAMATIONS L'UN CONTRE L'AUTRE UNIQUEMENT EN VOTRE <strong>CAPACITÉ INDIVIDUELLE</strong>, ET NON EN TANT QUE PLAIGNANT OU MEMBRE D'UN <strong>RECOURS COLLECTIF</strong>. De plus, toute réclamation doit être déposée dans un <strong>délai d'un (1) an</strong> après la survenance de la cause de l'action, sinon elle sera définitivement prescrite.",
        "terms_general_title": "11. Dispositions Générales",
        "terms_general_p1": "<strong>Intégralité de l'Accord:</strong> Ces Conditions, ainsi que la Politique de Confidentialité, constituent l'accord complet et exclusif entre vous et ProjectNocturne concernant le Service.",
        "terms_general_p2": "<strong>Divisibilité:</strong> Si une disposition de ces Conditions est jugée invalide par un tribunal, les autres dispositions resteront en vigueur.",
        "terms_general_p3": "<strong>Non-renonciation:</strong> Notre incapacité à faire respecter un droit ou une disposition de ces Conditions ne sera pas considérée comme une renonciation à ces droits.",
        "terms_general_p4": "<strong>Cession:</strong> Vous ne pouvez pas céder ou transférer ces Conditions sans notre consentement écrit préalable. Nous pouvons librement céder ou transférer ces Conditions sans restriction.",
        "terms_contact_title": "12. Contact et Rapports",
        "terms_contact_p1": "Pour toute question générale, rapport de bogue ou préoccupation concernant ces Conditions, le canal de communication officiel est notre <strong><a href=\"#\" data-action=\"submit-feedback\" class=\"legal-link\">Formulaire de commentaires</a></strong> disponible sur la Plateforme. Nous nous efforcerons de répondre dans un délai raisonnable. Ce canal ne doit pas être utilisé pour les notifications légales formelles.",
        "cookies_s1_title": "1. Préambule et Déclaration de Principes",
        "cookies_s1_p1": "La présente Politique de Cookies et de Technologies de Stockage Local (ci-après, « la Politique ») vise à fournir une description complète et transparente de l'utilisation des technologies de stockage du navigateur par la plateforme web ProjectNocturne (ci-après, « le Service »). Ce document complète notre Politique de Confidentialité et nos Conditions Générales, en se concentrant spécifiquement sur les données stockées sur l'appareil de l'utilisateur pour garantir la fonctionnalité, la personnalisation et la persistance de l'expérience. Notre philosophie de fonctionnement repose sur un pilier de transparence maximale et de respect de l'autonomie de l'utilisateur. Conformément à ce principe, nous déclarons explicitement que <strong>ProjectNocturne n'utilise pas de cookies HTTP traditionnels à des fins de suivi, de publicité ou d'analyse par des tiers.</strong> Nous n'implémentons pas de mécanismes qui suivent votre comportement en dehors de notre domaine, et nous ne partageons pas d'informations avec des réseaux publicitaires ou des courtiers en données. Le choix d'utiliser des technologies de stockage local au lieu de cookies est une décision de conception délibérée, visant à donner plus de pouvoir à l'utilisateur en garantissant que ses données de configuration restent sous son contrôle exclusif. Notre utilisation de ces technologies est irrévocablement limitée à des fins strictement fonctionnelles, qui sont indispensables pour fournir une expérience utilisateur robuste, cohérente et hautement personnalisée. L'interaction et l'utilisation continue du Service impliquent la connaissance et l'acceptation des pratiques de stockage local décrites ici, qui sont essentielles au fonctionnement de la plateforme.",
        "cookies_s2_title": "2. Finalités et Catégories de Données Stockées Localement",
        "cookies_s2_p1": "Le stockage de données dans votre navigateur est une exigence technique indispensable pour que le Service puisse offrir ses principales fonctionnalités. Les catégories de données stockées et leurs finalités spécifiques sont détaillées ci-dessous :",
        "cookies_s2_ss1_title": "2.1. Persistance de la Configuration des Outils et de l'État de l'Application",
        "cookies_s2_ss1_p1": "Pour que le Service dépasse la nature d'une simple page web et se comporte comme une application persistante, il est essentiel de sauvegarder l'état de vos interactions. Nous stockons localement toutes les configurations que vous définissez dans nos outils pour assurer une continuité transparente entre les sessions. Cela inclut les propriétés détaillées des <strong>alarmes</strong> que vous créez, les paramètres de durée et de son des <strong>minuteurs</strong>, la liste et la personnalisation des <strong>horloges mondiales</strong>, et l'état complet du <strong>chronomètre</strong>, y compris le temps écoulé et l'historique des tours. Sans ce stockage fonctionnel, toute configuration serait immédiatement perdue à la fermeture ou à l'actualisation de l'onglet, ce qui nuirait à l'utilité fondamentale du Service.",
        "cookies_s2_ss2_title": "2.2. Personnalisation Avancée de l'Interface et de l'Expérience Utilisateur",
        "cookies_s2_ss2_p1": "ProjectNocturne offre un haut degré de personnalisation pour s'adapter à vos préférences esthétiques et d'ergonomie. Pour mémoriser et appliquer automatiquement cette personnalisation à chaque visite, nous enregistrons localement la sélection du <strong>thème visuel</strong> (clair, sombre ou synchronisé avec le système), la <strong>langue de l'interface</strong>, ainsi que vos <strong>préférences de style typographique</strong>, comme la couleur et les attributs de format (gras, italique) pour les principaux éléments textuels. De plus, un enregistrement des <strong>couleurs récemment utilisées</strong> et de l'<strong>état d'affichage (plié/déplié)</strong> des menus est conservé pour optimiser la navigation et réduire les frictions lors d'une utilisation récurrente.",
        "cookies_s2_ss3_title": "2.3. Gestion du Contenu Généré par l'Utilisateur",
        "cookies_s2_ss3_p1": "Le Service vous permet d'aller au-delà des options par défaut en facilitant le téléchargement de vos propres fichiers audio pour les notifications. Pour gérer ce contenu de manière sécurisée et privée, nous utilisons la technologie <code>IndexedDB</code>. Cela signifie que vos <strong>fichiers audio personnalisés</strong> sont stockés dans une base de données locale et sécurisée au sein de votre propre navigateur. Nous soulignons que ces fichiers ne sont <strong>ni transférés, ni hébergés, ni traités sur nos serveurs</strong> ; ils restent sous votre contrôle exclusif sur votre appareil.",
        "cookies_s2_ss4_title": "2.4. Optimisation du Service via des Analyses Anonymes",
        "cookies_s2_ss4_p1": "Pour l'amélioration continue de ProjectNocturne, nous attribuons un <strong>identifiant de session totalement anonyme</strong> à votre navigateur. Cet identifiant ne contient aucune information personnelle et ne peut pas être utilisé pour votre identification. Son unique but est de nous permettre de regrouper les événements d'interaction de manière agrégée pour des analyses d'ergonomie internes, nous permettant de prendre des décisions de développement éclairées, toujours dans une perspective d'anonymat total.",
        "cookies_s3_title": "3. Gestion et Suppression des Données par l'Utilisateur",
        "cookies_s3_p1": "Conformément à notre philosophie d'autonomisation, vous, en tant qu'utilisateur, êtes le seul gardien et administrateur des données stockées localement sur votre appareil. Nous vous donnons un contrôle absolu pour gérer et supprimer ces informations à tout moment. Ce faisant, l'application se réinitialisera à son état d'origine, comme si c'était votre première visite.",
        "cookies_s3_p2": "Pour supprimer les données stockées, vous devez utiliser les outils de nettoyage de données intégrés à votre navigateur web. La procédure générale consiste à accéder aux <strong>Paramètres</strong>, à trouver la section <strong>« Confidentialité et sécurité »</strong>, et à sélectionner <strong>« Effacer les données de navigation »</strong>. Assurez-vous de sélectionner l'intervalle de temps « Toutes les données » et de cocher la case correspondant à <strong>« Cookies et autres données des sites »</strong>. Il est important de comprendre que cette action est irréversible et supprimera tous vos paramètres enregistrés.",
        "cookies_s4_title": "4. Consentement Implicite pour les Fonctionnalités Essentielles",
        "cookies_s4_p1": "En utilisant les diverses fonctionnalités de ProjectNocturne, vous donnez votre consentement implicite et acceptez le stockage local des données fonctionnelles décrites dans cette politique. Il doit être entendu que ce stockage n'est pas optionnel, mais constitue plutôt une condition technique <strong>strictement nécessaire</strong> pour le bon fonctionnement des fonctionnalités de personnalisation et de persistance qui définissent la proposition de valeur fondamentale du Service. Sans ces technologies, la plateforme ne pourrait pas fonctionner comme elle a été conçue."
    }
}